from datetime import date
from model import Slaščičar

LOGO = '''
_______  ___      _______  ______   ___   _  _______  _______  __    _  _______  ______  
|       ||   |    |   _   ||      | |   | | ||       ||       ||  |  | ||       ||      | 
|  _____||   |    |  |_|  ||  _    ||   |_| ||   _   ||  _____||   |_| ||    ___||  _    |
| |_____ |   |    |       || | |   ||      _||  | |  || |_____ |       ||   |___ | | |   |
|_____  ||   |___ |       || |_|   ||     |_ |  |_|  ||_____  ||  _    ||    ___|| |_|   |
 _____| ||       ||   _   ||       ||    _  ||       | _____| || | |   ||   |___ |       |
|_______||_______||__| |__||______| |___| |_||_______||_______||_|  |__||_______||______| 

'''

DATOTEKA_S_SLADICAMI = 'sladice.json'

try:
    slaščičar = Slaščičar.nalozi_stanje(DATOTEKA_S_SLADICAMI)
except FileNotFoundError:
    slaščičar = Slaščičar()


